PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_lppass_mmio_v1_1.h
#define LPPASS_MMIO_INTR_MASK_DAC1_EMPTY_MASK_Pos 17UL
#define LPPASS_MMIO_INTR_MASK_DAC1_EMPTY_MASK_Msk 0x20000UL
#define LPPASS_MMIO_INTR_MASK_SAR_DONE_MASK_Pos 18UL
#define LPPASS_MMIO_INTR_MASK_SAR_DONE_MASK_Msk 0x40000UL
#define LPPASS_MMIO_INTR_MASK_SAR_EOS_MASK_Pos  19UL
#define LPPASS_MMIO_INTR_MASK_SAR_EOS_MASK_Msk  0x80000UL
#define LPPASS_MMIO_INTR_MASK_SAR_RESULT_MASK_Pos 20UL
#define LPPASS_MMIO_INTR_MASK_SAR_RESULT_MASK_Msk 0x100000UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE0_MASK_Pos 21UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE0_MASK_Msk 0x200000UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE1_MASK_Pos 22UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE1_MASK_Msk 0x400000UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE2_MASK_Pos 23UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE2_MASK_Msk 0x800000UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE3_MASK_Pos 24UL
#define LPPASS_MMIO_INTR_MASK_SAR_RANGE3_MASK_Msk 0x1000000UL
#define LPPASS_MMIO_INTR_MASK_SAR_FIR0_RESULT_MASK_Pos 25UL
#define LPPASS_MMIO_INTR_MASK_SAR_FIR0_RESULT_MASK_Msk 0x2000000UL
#define LPPASS_MMIO_INTR_MASK_SAR_FIR1_RESULT_MASK_Pos 26UL
#define LPPASS_MMIO_INTR_MASK_SAR_FIR1_RESULT_MASK_Msk 0x4000000UL
#define LPPASS_MMIO_INTR_MASK_RESERVED_Pos      27UL
#define LPPASS_MMIO_INTR_MASK_RESERVED_Msk      0x78000000UL
#define LPPASS_MMIO_INTR_MASK_AC_MASK_Pos       31UL
#define LPPASS_MMIO_INTR_MASK_AC_MASK_Msk       0x80000000UL
/* LPPASS_MMIO.INTR_MASKED */
#define LPPASS_MMIO_INTR_MASKED_CTBL0_COMP0_MASKED_Pos 0UL
#define LPPASS_MMIO_INTR_MASKED_CTBL0_COMP0_MASKED_Msk 0x1UL
#define LPPASS_MMIO_INTR_MASKED_CTBL0_COMP1_MASKED_Pos 1UL
#define LPPASS_MMIO_INTR_MASKED_CTBL0_COMP1_MASKED_Msk 0x2UL
#define LPPASS_MMIO_INTR_MASKED_CTBL1_COMP0_MASKED_Pos 2UL
#define LPPASS_MMIO_INTR_MASKED_CTBL1_COMP0_MASKED_Msk 0x4UL
#define LPPASS_MMIO_INTR_MASKED_CTBL1_COMP1_MASKED_Pos 3UL
#define LPPASS_MMIO_INTR_MASKED_CTBL1_COMP1_MASKED_Msk 0x8UL
#define LPPASS_MMIO_INTR_MASKED_PTC_COMP0_MASKED_Pos 4UL
#define LPPASS_MMIO_INTR_MASKED_PTC_COMP0_MASKED_Msk 0x10UL
#define LPPASS_MMIO_INTR_MASKED_PTC_COMP1_MASKED_Pos 5UL
#define LPPASS_MMIO_INTR_MASKED_PTC_COMP1_MASKED_Msk 0x20UL
#define LPPASS_MMIO_INTR_MASKED_PTC_RANGE0_MASKED_Pos 6UL
#define LPPASS_MMIO_INTR_MASKED_PTC_RANGE0_MASKED_Msk 0x40UL
#define LPPASS_MMIO_INTR_MASKED_PTC_RANGE1_MASKED_Pos 7UL
#define LPPASS_MMIO_INTR_MASKED_PTC_RANGE1_MASKED_Msk 0x80UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_RANGE0_MASKED_Pos 8UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_RANGE0_MASKED_Msk 0x100UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_RANGE1_MASKED_Pos 9UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_RANGE1_MASKED_Msk 0x200UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_RANGE2_MASKED_Pos 10UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_RANGE2_MASKED_Msk 0x400UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_EPOCH_MASKED_Pos 11UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_EPOCH_MASKED_Msk 0x800UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_EMPTY_MASKED_Pos 12UL
#define LPPASS_MMIO_INTR_MASKED_DAC0_EMPTY_MASKED_Msk 0x1000UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_RANGE0_MASKED_Pos 13UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_RANGE0_MASKED_Msk 0x2000UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_RANGE1_MASKED_Pos 14UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_RANGE1_MASKED_Msk 0x4000UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_RANGE2_MASKED_Pos 15UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_RANGE2_MASKED_Msk 0x8000UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_EPOCH_MASKED_Pos 16UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_EPOCH_MASKED_Msk 0x10000UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_EMPTY_MASKED_Pos 17UL
#define LPPASS_MMIO_INTR_MASKED_DAC1_EMPTY_MASKED_Msk 0x20000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_DONE_MASKED_Pos 18UL
#define LPPASS_MMIO_INTR_MASKED_SAR_DONE_MASKED_Msk 0x40000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_EOS_MASKED_Pos 19UL
#define LPPASS_MMIO_INTR_MASKED_SAR_EOS_MASKED_Msk 0x80000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RESULT_MASKED_Pos 20UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RESULT_MASKED_Msk 0x100000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE0_MASKED_Pos 21UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE0_MASKED_Msk 0x200000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE1_MASKED_Pos 22UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE1_MASKED_Msk 0x400000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE2_MASKED_Pos 23UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE2_MASKED_Msk 0x800000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE3_MASKED_Pos 24UL
#define LPPASS_MMIO_INTR_MASKED_SAR_RANGE3_MASKED_Msk 0x1000000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_FIR0_RESULT_MASKED_Pos 25UL
#define LPPASS_MMIO_INTR_MASKED_SAR_FIR0_RESULT_MASKED_Msk 0x2000000UL
#define LPPASS_MMIO_INTR_MASKED_SAR_FIR1_RESULT_MASKED_Pos 26UL
#define LPPASS_MMIO_INTR_MASKED_SAR_FIR1_RESULT_MASKED_Msk 0x4000000UL
#define LPPASS_MMIO_INTR_MASKED_RESERVED_Pos    27UL
#define LPPASS_MMIO_INTR_MASKED_RESERVED_Msk    0x78000000UL
#define LPPASS_MMIO_INTR_MASKED_AC_MASKED_Pos   31UL
#define LPPASS_MMIO_INTR_MASKED_AC_MASKED_Msk   0x80000000UL
/* LPPASS_MMIO.FIFO_INTR */
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW0_Pos 0UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW0_Msk 0x1UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW1_Pos 1UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW1_Msk 0x2UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW2_Pos 2UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW2_Msk 0x4UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW3_Pos 3UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW3_Msk 0x8UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW4_Pos 4UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW4_Msk 0x10UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW5_Pos 5UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW5_Msk 0x20UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW6_Pos 6UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW6_Msk 0x40UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW7_Pos 7UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_OVERFLOW7_Msk 0x80UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW0_Pos 8UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW0_Msk 0x100UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW1_Pos 9UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW1_Msk 0x200UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW2_Pos 10UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW2_Msk 0x400UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW3_Pos 11UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW3_Msk 0x800UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW4_Pos 12UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW4_Msk 0x1000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW5_Pos 13UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW5_Msk 0x2000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW6_Pos 14UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW6_Msk 0x4000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW7_Pos 15UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_UNDERFLOW7_Msk 0x8000UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_0_Pos    16UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_0_Msk    0x10000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL0_Pos   17UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL0_Msk   0x20000UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_1_Pos    18UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_1_Msk    0xC0000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL1_Pos   20UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL1_Msk   0x100000UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_2_Pos    21UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_2_Msk    0x1E00000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL2_Pos   25UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL2_Msk   0x2000000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL3_Pos   26UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL3_Msk   0x4000000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL4_Pos   27UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL4_Msk   0x8000000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL5_Pos   28UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL5_Msk   0x10000000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL6_Pos   29UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL6_Msk   0x20000000UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL7_Pos   30UL
#define LPPASS_MMIO_FIFO_INTR_FIFO_LEVEL7_Msk   0x40000000UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_3_Pos    31UL
#define LPPASS_MMIO_FIFO_INTR_RESERVED_3_Msk    0x80000000UL
/* LPPASS_MMIO.FIFO_INTR_SET */
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW0_SET_Pos 0UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW0_SET_Msk 0x1UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW1_SET_Pos 1UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW1_SET_Msk 0x2UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW2_SET_Pos 2UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW2_SET_Msk 0x4UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW3_SET_Pos 3UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW3_SET_Msk 0x8UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW4_SET_Pos 4UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW4_SET_Msk 0x10UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW5_SET_Pos 5UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW5_SET_Msk 0x20UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW6_SET_Pos 6UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW6_SET_Msk 0x40UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW7_SET_Pos 7UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_OVERFLOW7_SET_Msk 0x80UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW0_SET_Pos 8UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW0_SET_Msk 0x100UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW1_SET_Pos 9UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW1_SET_Msk 0x200UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW2_SET_Pos 10UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW2_SET_Msk 0x400UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW3_SET_Pos 11UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW3_SET_Msk 0x800UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW4_SET_Pos 12UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW4_SET_Msk 0x1000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW5_SET_Pos 13UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW5_SET_Msk 0x2000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW6_SET_Pos 14UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW6_SET_Msk 0x4000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW7_SET_Pos 15UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_UNDERFLOW7_SET_Msk 0x8000UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_0_Pos 16UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_0_Msk 0x10000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL0_SET_Pos 17UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL0_SET_Msk 0x20000UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_1_Pos 18UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_1_Msk 0xC0000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL1_SET_Pos 20UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL1_SET_Msk 0x100000UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_2_Pos 21UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_2_Msk 0x1E00000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL2_SET_Pos 25UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL2_SET_Msk 0x2000000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL3_SET_Pos 26UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL3_SET_Msk 0x4000000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL4_SET_Pos 27UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL4_SET_Msk 0x8000000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL5_SET_Pos 28UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL5_SET_Msk 0x10000000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL6_SET_Pos 29UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL6_SET_Msk 0x20000000UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL7_SET_Pos 30UL
#define LPPASS_MMIO_FIFO_INTR_SET_FIFO_LEVEL7_SET_Msk 0x40000000UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_3_Pos 31UL
#define LPPASS_MMIO_FIFO_INTR_SET_RESERVED_3_Msk 0x80000000UL
/* LPPASS_MMIO.FIFO_INTR_MASK */
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW0_MASK_Pos 0UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW0_MASK_Msk 0x1UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW1_MASK_Pos 1UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW1_MASK_Msk 0x2UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW2_MASK_Pos 2UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW2_MASK_Msk 0x4UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW3_MASK_Pos 3UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW3_MASK_Msk 0x8UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW4_MASK_Pos 4UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW4_MASK_Msk 0x10UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW5_MASK_Pos 5UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW5_MASK_Msk 0x20UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW6_MASK_Pos 6UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW6_MASK_Msk 0x40UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW7_MASK_Pos 7UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_OVERFLOW7_MASK_Msk 0x80UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW0_MASK_Pos 8UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW0_MASK_Msk 0x100UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW1_MASK_Pos 9UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW1_MASK_Msk 0x200UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW2_MASK_Pos 10UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW2_MASK_Msk 0x400UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW3_MASK_Pos 11UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW3_MASK_Msk 0x800UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW4_MASK_Pos 12UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW4_MASK_Msk 0x1000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW5_MASK_Pos 13UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW5_MASK_Msk 0x2000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW6_MASK_Pos 14UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW6_MASK_Msk 0x4000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW7_MASK_Pos 15UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_UNDERFLOW7_MASK_Msk 0x8000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_0_Pos 16UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_0_Msk 0x10000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL0_MASK_Pos 17UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL0_MASK_Msk 0x20000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_1_Pos 18UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_1_Msk 0xC0000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL1_MASK_Pos 20UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL1_MASK_Msk 0x100000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_2_Pos 21UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_2_Msk 0x1E00000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL2_MASK_Pos 25UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL2_MASK_Msk 0x2000000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL3_MASK_Pos 26UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL3_MASK_Msk 0x4000000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL4_MASK_Pos 27UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL4_MASK_Msk 0x8000000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL5_MASK_Pos 28UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL5_MASK_Msk 0x10000000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL6_MASK_Pos 29UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL6_MASK_Msk 0x20000000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL7_MASK_Pos 30UL
#define LPPASS_MMIO_FIFO_INTR_MASK_FIFO_LEVEL7_MASK_Msk 0x40000000UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_3_Pos 31UL
#define LPPASS_MMIO_FIFO_INTR_MASK_RESERVED_3_Msk 0x80000000UL
/* LPPASS_MMIO.FIFO_INTR_MASKED */
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW0_MASKED_Pos 0UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW0_MASKED_Msk 0x1UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW1_MASKED_Pos 1UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW1_MASKED_Msk 0x2UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW2_MASKED_Pos 2UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW2_MASKED_Msk 0x4UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW3_MASKED_Pos 3UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW3_MASKED_Msk 0x8UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW4_MASKED_Pos 4UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW4_MASKED_Msk 0x10UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW5_MASKED_Pos 5UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW5_MASKED_Msk 0x20UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW6_MASKED_Pos 6UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW6_MASKED_Msk 0x40UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW7_MASKED_Pos 7UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_OVERFLOW7_MASKED_Msk 0x80UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW0_MASKED_Pos 8UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW0_MASKED_Msk 0x100UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW1_MASKED_Pos 9UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW1_MASKED_Msk 0x200UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW2_MASKED_Pos 10UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW2_MASKED_Msk 0x400UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW3_MASKED_Pos 11UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW3_MASKED_Msk 0x800UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW4_MASKED_Pos 12UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW4_MASKED_Msk 0x1000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW5_MASKED_Pos 13UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW5_MASKED_Msk 0x2000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW6_MASKED_Pos 14UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW6_MASKED_Msk 0x4000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW7_MASKED_Pos 15UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_UNDERFLOW7_MASKED_Msk 0x8000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_0_Pos 16UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_0_Msk 0x10000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL0_MASKED_Pos 17UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL0_MASKED_Msk 0x20000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_1_Pos 18UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_1_Msk 0xC0000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL1_MASKED_Pos 20UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL1_MASKED_Msk 0x100000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_2_Pos 21UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_2_Msk 0x1E00000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL2_MASKED_Pos 25UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL2_MASKED_Msk 0x2000000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL3_MASKED_Pos 26UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL3_MASKED_Msk 0x4000000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL4_MASKED_Pos 27UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL4_MASKED_Msk 0x8000000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL5_MASKED_Pos 28UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL5_MASKED_Msk 0x10000000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL6_MASKED_Pos 29UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL6_MASKED_Msk 0x20000000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL7_MASKED_Pos 30UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_FIFO_LEVEL7_MASKED_Msk 0x40000000UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_3_Pos 31UL
#define LPPASS_MMIO_FIFO_INTR_MASKED_RESERVED_3_Msk 0x80000000UL


#endif /* _CYIP_LPPASS_MMIO_V1_1_H_ */


/* [] END OF FILE */
